eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**************************************************************************//**
 * Copyright 2018, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

#ifndef _SL_WFX_CMD_API_H_
#define _SL_WFX_CMD_API_H_

#include "sl_wfx_general_api.h"

/**
 * @addtogroup FULL_MAC_API
 * @brief Wireless LAN Full MAC (WFM) API
 *
 * This module describes the functionality and the API messages of the Upper MAC (UMAC)
 * component of the device. UMAC provides the Wireless LAN Full MAC (WFM) API. WFM API
 * is used with the general API messages described in @ref GENERAL_API.
 *
 * The device is capable of operating in different roles such as a Wi-Fi client and
 * as a Wi-Fi Access Point. To use multiple roles at
 * the same time, the device is split into logical units called interfaces.
 *
 * Two interfaces are available for WFM API. They are referenced with interface
 * IDs 0 and 1. For general information on how to format the API messages, see
 * @ref MESSAGE_CONSTRUCTION.
 *
 * For a list of WFM API messages, see @ref WFM_GROUP_MESSAGES for further details.
 * @{
 */

/**
 * @defgroup WFM_GROUP_CONCEPTS API concepts
 * @brief WFM API concepts.
 */

/**
 * @defgroup WFM_GROUP_CONSTANTS API constant values
 * @brief WFM API constant values.
 */

/**
 * @defgroup WFM_GROUP_TYPES API types
 * @brief WFM API types.
 */

/**
 * @defgroup WFM_GROUP_MESSAGE_IDS API message IDs
 * @brief WFM API message IDs.
 */

/**
 * @defgroup WFM_GROUP_MESSAGES API messages
 * @brief WFM API messages.
 */

/**
 * @defgroup WFM_GROUP_MESSAGES_BY_MODE API messages by mode
 * @brief WFM API messages organized by mode.
 * @{
 */

/**
 * @defgroup WFM_GROUP_MODE_IDLE API messages in idle mode
 * @brief WFM API messages applicable for an interface in idle mode.
 */

/**
 * @defgroup WFM_GROUP_MODE_STA API messages in station mode
 * @brief WFM API messages applicable for an interface in STA mode.
 */

/**
 * @defgroup WFM_GROUP_MODE_AP API messages in AP mode
 * @brief WFM API messages applicable for an interface in AP mode.
 */

/**
 * @}
 */

/**
 * @addtogroup WFM_GROUP_MESSAGE_IDS
 * @{
 */

/**
 * @brief WFM API request message IDs.
 */
typedef enum sl_wfx_requests_ids_e {
  SL_WFX_SET_MAC_ADDRESS_REQ_ID                  = 0x42,   ///< \b SET_MAC_ADDRESS request ID uses body SL_WFX_SET_MAC_ADDRESS_REQ_BODY and returns SL_WFX_SET_MAC_ADDRESS_CNF_BODY
  SL_WFX_CONNECT_REQ_ID                          = 0x43,   ///< \b CONNECT request ID uses body SL_WFX_CONNECT_REQ_BODY and returns SL_WFX_CONNECT_CNF_BODY
  SL_WFX_DISCONNECT_REQ_ID                       = 0x44,   ///< \b DISCONNECT request ID uses body SL_WFX_DISCONNECT_REQ_BODY and returns SL_WFX_DISCONNECT_CNF_BODY
  SL_WFX_START_AP_REQ_ID                         = 0x45,   ///< \b START_AP request ID uses body SL_WFX_START_AP_REQ_BODY and returns SL_WFX_START_AP_CNF_BODY
  SL_WFX_UPDATE_AP_REQ_ID                        = 0x46,   ///< \b UPDATE_AP request ID uses body SL_WFX_UPDATE_AP_REQ_BODY and returns SL_WFX_UPDATE_AP_CNF_BODY
  SL_WFX_STOP_AP_REQ_ID                          = 0x47,   ///< \b STOP_AP request ID uses body SL_WFX_STOP_AP_REQ_BODY and returns SL_WFX_STOP_AP_CNF_BODY
  SL_WFX_SEND_FRAME_REQ_ID                       = 0x4a,   ///< \b SEND_FRAME request ID uses body SL_WFX_SEND_FRAME_REQ_BODY and returns SL_WFX_SEND_FRAME_CNF_BODY
  SL_WFX_START_SCAN_REQ_ID                       = 0x4b,   ///< \b START_SCAN request ID uses body SL_WFX_START_SCAN_REQ_BODY and returns SL_WFX_START_SCAN_CNF_BODY
  SL_WFX_STOP_SCAN_REQ_ID                        = 0x4c,   ///< \b STOP_SCAN request ID uses body SL_WFX_STOP_SCAN_REQ_BODY and returns SL_WFX_STOP_SCAN_CNF_BODY
  SL_WFX_GET_SIGNAL_STRENGTH_REQ_ID              = 0x4e,   ///< \b GET_SIGNAL_STRENGTH request ID uses body SL_WFX_GET_SIGNAL_STRENGTH_REQ_BODY and returns SL_WFX_GET_SIGNAL_STRENGTH_CNF_BODY
  SL_WFX_DISCONNECT_AP_CLIENT_REQ_ID             = 0x4f,   ///< \b DISCONNECT_AP_CLIENT request ID uses body SL_WFX_DISCONNECT_AP_CLIENT_REQ_BODY and returns SL_WFX_DISCONNECT_AP_CLIENT_CNF_BODY
  SL_WFX_SET_PM_MODE_REQ_ID                      = 0x52,   ///< \b SET_PM_MODE request ID uses body SL_WFX_SET_PM_MODE_REQ_BODY and returns SL_WFX_SET_PM_MODE_CNF_BODY
  SL_WFX_ADD_MULTICAST_ADDR_REQ_ID               = 0x53,   ///< \b ADD_MULTICAST_ADDR request ID uses body SL_WFX_ADD_MULTICAST_ADDR_REQ_BODY and returns SL_WFX_ADD_MULTICAST_ADDR_CNF_BODY
  SL_WFX_REMOVE_MULTICAST_ADDR_REQ_ID            = 0x54,   ///< \b REMOVE_MULTICAST_ADDR request ID uses body SL_WFX_REMOVE_MULTICAST_ADDR_REQ_BODY and returns SL_WFX_REMOVE_MULTICAST_ADDR_CNF_BODY
  SL_WFX_SET_MAX_AP_CLIENT_COUNT_REQ_ID          = 0x55,   ///< \b SET_MAX_AP_CLIENT_COUNT request ID uses body SL_WFX_SET_MAX_AP_CLIENT_COUNT_REQ_BODY and returns SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_BODY
  SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_REQ_ID     = 0x56,   ///< \b SET_MAX_AP_CLIENT_INACTIVITY request ID uses body SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_REQ_BODY and returns SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_BODY
  SL_WFX_SET_ROAM_PARAMETERS_REQ_ID              = 0x57,   ///< \b SET_ROAM_PARAMETERS request ID uses body SL_WFX_SET_ROAM_PARAMETERS_REQ_BODY and returns SL_WFX_SET_ROAM_PARAMETERS_CNF_BODY
  SL_WFX_SET_TX_RATE_PARAMETERS_REQ_ID           = 0x58,   ///< \b SET_TX_RATE_PARAMETERS request ID uses body SL_WFX_SET_TX_RATE_PARAMETERS_REQ_BODY and returns SL_WFX_SET_TX_RATE_PARAMETERS_CNF_BODY
  SL_WFX_SET_ARP_IP_ADDRESS_REQ_ID               = 0x59,   ///< \b SET_ARP_IP_ADDRESS request ID uses body SL_WFX_SET_ARP_IP_ADDRESS_REQ_BODY and returns SL_WFX_SET_ARP_IP_ADDRESS_CNF_BODY
  SL_WFX_SET_NS_IP_ADDRESS_REQ_ID                = 0x5A,   ///< \b SET_NS_IP_ADDRESS request ID uses body SL_WFX_SET_NS_IP_ADDRESS_REQ_BODY and returns SL_WFX_SET_NS_IP_ADDRESS_CNF_BODY
  SL_WFX_SET_BROADCAST_FILTER_REQ_ID             = 0x5B,   ///< \b SET_BROADCAST_FILTER request ID uses body SL_WFX_SET_BROADCAST_FILTER_REQ_BODY and returns SL_WFX_SET_BROADCAST_FILTER_CNF_BODY
  SL_WFX_SET_SCAN_PARAMETERS_REQ_ID              = 0x5C,   ///< \b SET_SCAN_PARAMETERS request ID uses body SL_WFX_SET_SCAN_PARAMETERS_REQ_BODY and returns SL_WFX_SET_SCAN_PARAMETERS_CNF_BODY
  SL_WFX_SET_UNICAST_FILTER_REQ_ID               = 0x5D,   ///< \b SET_UNICAST_FILTER request ID uses body SL_WFX_SET_UNICAST_FILTER_REQ_BODY and returns SL_WFX_SET_UNICAST_FILTER_CNF_BODY
  SL_WFX_ADD_WHITELIST_ADDR_REQ_ID               = 0x5E,   ///< \b ADD_WHITELIST_ADDR request ID uses body SL_WFX_ADD_WHITELIST_ADDR_REQ_BODY and returns SL_WFX_ADD_WHITELIST_ADDR_CNF_BODY
  SL_WFX_ADD_BLACKLIST_ADDR_REQ_ID               = 0x5F,   ///< \b ADD_BLACKLIST_ADDR request ID uses body SL_WFX_ADD_BLACKLIST_ADDR_REQ_BODY and returns SL_WFX_ADD_BLACKLIST_ADDR_CNF_BODY
  SL_WFX_SET_MAX_TX_POWER_REQ_ID                 = 0x60,   ///< \b SET_MAX_TX_POWER request ID uses body SL_WFX_SET_MAX_TX_POWER_REQ_BODY and returns SL_WFX_SET_MAX_TX_POWER_CNF_BODY
  SL_WFX_GET_MAX_TX_POWER_REQ_ID                 = 0x61,   ///< \b GET_MAX_TX_POWER request ID uses body SL_WFX_GET_MAX_TX_POWER_REQ_BODY and returns SL_WFX_GET_MAX_TX_POWER_CNF_BODY
  SL_WFX_GET_PMK_REQ_ID                          = 0x62,   ///< \b GET_PMK request ID uses body SL_WFX_GET_PMK_REQ_BODY and returns SL_WFX_GET_PMK_CNF_BODY
  SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_REQ_ID    = 0x63    ///< \b GET_AP_CLIENT_SIGNAL_STRENGTH request ID uses body SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_BODY and returns SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_BODY
} sl_wfx_requests_ids_t;

/**
 * @brief WFM API confirmation message IDs.
 */
typedef enum sl_wfx_confirmations_ids_e {
  SL_WFX_SET_MAC_ADDRESS_CNF_ID                  = 0x42,   ///< \b SET_MAC_ADDRESS confirmation Id. Returns body SL_WFX_SET_MAC_ADDRESS_CNF_BODY
  SL_WFX_CONNECT_CNF_ID                          = 0x43,   ///< \b CONNECT confirmation Id. Returns body SL_WFX_CONNECT_CNF_BODY
  SL_WFX_DISCONNECT_CNF_ID                       = 0x44,   ///< \b DISCONNECT confirmation Id. Returns body SL_WFX_DISCONNECT_CNF_BODY
  SL_WFX_START_AP_CNF_ID                         = 0x45,   ///< \b START_AP confirmation Id. Returns body SL_WFX_START_AP_CNF_BODY
  SL_WFX_UPDATE_AP_CNF_ID                        = 0x46,   ///< \b UPDATE_AP confirmation Id. Returns body SL_WFX_UPDATE_AP_CNF_BODY
  SL_WFX_STOP_AP_CNF_ID                          = 0x47,   ///< \b STOP_AP confirmation Id. Returns body SL_WFX_STOP_AP_CNF_BODY
  SL_WFX_SEND_FRAME_CNF_ID                       = 0x4a,   ///< \b SEND_FRAME confirmation Id. Returns body SL_WFX_SEND_FRAME_CNF_BODY
  SL_WFX_START_SCAN_CNF_ID                       = 0x4b,   ///< \b START_SCAN confirmation Id. Returns body SL_WFX_START_SCAN_CNF_BODY
  SL_WFX_STOP_SCAN_CNF_ID                        = 0x4c,   ///< \b STOP_SCAN confirmation Id. Returns body SL_WFX_STOP_SCAN_CNF_BODY
  SL_WFX_GET_SIGNAL_STRENGTH_CNF_ID              = 0x4e,   ///< \b GET_SIGNAL_STRENGTH confirmation Id. Returns body SL_WFX_GET_SIGNAL_STRENGTH_CNF_BODY
  SL_WFX_DISCONNECT_AP_CLIENT_CNF_ID             = 0x4f,   ///< \b DISCONNECT_AP_CLIENT confirmation Id. Returns body SL_WFX_DISCONNECT_AP_CLIENT_CNF_BODY
  SL_WFX_SET_PM_MODE_CNF_ID                      = 0x52,   ///< \b SET_PM_MODE confirmation Id. Returns body SL_WFX_SET_PM_MODE_CNF_BODY
  SL_WFX_ADD_MULTICAST_ADDR_CNF_ID               = 0x53,   ///< \b ADD_MULTICAST_ADDR confirmation Id. Returns body SL_WFX_ADD_MULTICAST_ADDR_CNF_BODY
  SL_WFX_REMOVE_MULTICAST_ADDR_CNF_ID            = 0x54,   ///< \b REMOVE_MULTICAST_ADDR confirmation Id. Returns body SL_WFX_REMOVE_MULTICAST_ADDR_CNF_BODY
  SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_ID          = 0x55,   ///< \b SET_MAX_AP_CLIENT_COUNT confirmation Id. Returns body SL_WFX_SET_MAX_AP_CLIENT_COUNT_CNF_BODY
  SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_ID     = 0x56,   ///< \b SET_MAX_AP_CLIENT_INACTIVITY confirmation Id. Returns body SL_WFX_SET_MAX_AP_CLIENT_INACTIVITY_CNF_BODY
  SL_WFX_SET_ROAM_PARAMETERS_CNF_ID              = 0x57,   ///< \b SET_ROAM_PARAMETERS confirmation Id. Returns body SL_WFX_SET_ROAM_PARAMETERS_CNF_BODY
  SL_WFX_SET_TX_RATE_PARAMETERS_CNF_ID           = 0x58,   ///< \b SET_TX_RATE_PARAMETERS confirmation Id. Returns body SL_WFX_SET_TX_RATE_PARAMETERS_CNF_BODY
  SL_WFX_SET_ARP_IP_ADDRESS_CNF_ID               = 0x59,   ///< \b SET_ARP_IP_ADDRESS confirmation Id. Returns body SL_WFX_SET_ARP_IP_ADDRESS_CNF_BODY
  SL_WFX_SET_NS_IP_ADDRESS_CNF_ID                = 0x5A,   ///< \b SET_NS_IP_ADDRESS confirmation Id. Returns body SL_WFX_SET_NS_IP_ADDRESS_CNF_BODY
  SL_WFX_SET_BROADCAST_FILTER_CNF_ID             = 0x5B,   ///< \b SET_BROADCAST_FILTER confirmation Id. Returns body SL_WFX_SET_BROADCAST_FILTER_CNF_BODY
  SL_WFX_SET_SCAN_PARAMETERS_CNF_ID              = 0x5C,   ///< \b SET_SCAN_PARAMETERS confirmation Id. Returns body SL_WFX_SET_SCAN_PARAMETERS_CNF_BODY
  SL_WFX_SET_UNICAST_FILTER_CNF_ID               = 0x5D,   ///< \b SET_UNICAST_FILTER confirmation Id. Returns body SL_WFX_SET_UNICAST_FILTER_CNF_BODY
  SL_WFX_ADD_WHITELIST_ADDR_CNF_ID               = 0x5E,   ///< \b ADD_WHITELIST_ADDR confirmation Id. Returns body SL_WFX_ADD_WHITELIST_ADDR_CNF_BODY
  SL_WFX_ADD_BLACKLIST_ADDR_CNF_ID               = 0x5F,   ///< \b ADD_BLACKLIST_ADDR confirmation Id. Returns body SL_WFX_ADD_BLACKLIST_ADDR_CNF_BODY
  SL_WFX_SET_MAX_TX_POWER_CNF_ID                 = 0x60,   ///< \b SET_MAX_TX_POWER confirmation Id. Returns body SL_WFX_SET_MAX_TX_POWER_CNF_BODY
  SL_WFX_GET_MAX_TX_POWER_CNF_ID                 = 0x61,   ///< \b GET_MAX_TX_POWER confirmation Id. Returns body SL_WFX_GET_MAX_TX_POWER_CNF_BODY
  SL_WFX_GET_PMK_CNF_ID                          = 0x62,   ///< \b GET_PMK confirmation Id. Returns body SL_WFX_GET_PMK_CNF_BODY
  SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_ID    = 0x63    ///< \b GET_AP_CLIENT_SIGNAL_STRENGTH confirmation Id. Returns body SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_CNF_BODY
} sl_wfx_confirmations_ids_t;

/**
 * @brief WFM API indication message IDs.
 */
typedef enum sl_wfx_indications_ids_e {
  SL_WFX_CONNECT_IND_ID                          = 0xc3,   ///< \b CONNECT indication id. Content is SL_WFX_CONNECT_IND_BODY
  SL_WFX_DISCONNECT_IND_ID                       = 0xc4,   ///< \b DISCONNECT indication id. Content is SL_WFX_DISCONNECT_IND_BODY
  SL_WFX_START_AP_IND_ID                         = 0xc5,   ///< \b START_AP indication id. Content is SL_WFX_START_AP_IND_BODY
  SL_WFX_STOP_AP_IND_ID                          = 0xc7,   ///< \b STOP_AP indication id. Content is SL_WFX_STOP_AP_IND_BODY
  SL_WFX_RECEIVED_IND_ID                         = 0xca,   ///< \b RECEIVED indication id. Content is SL_WFX_RECEIVED_IND_BODY
  SL_WFX_SCAN_RESULT_IND_ID                      = 0xcb,   ///< \b SCAN_RESULT indication id. Content is SL_WFX_SCAN_RESULT_IND_BODY
  SL_WFX_SCAN_COMPLETE_IND_ID                    = 0xcc,   ///< \b SCAN_COMPLETE indication id. Content is SL_WFX_SCAN_COMPLETE_IND_BODY
  SL_WFX_AP_CLIENT_CONNECTED_IND_ID              = 0xcd,   ///< \b AP_CLIENT_CONNECTED indication id. Content is SL_WFX_AP_CLIENT_CONNECTED_IND_BODY
  SL_WFX_AP_CLIENT_REJECTED_IND_ID               = 0xce,   ///< \b AP_CLIENT_REJECTED indication id. Content is SL_WFX_AP_CLIENT_REJECTED_IND_BODY
  SL_WFX_AP_CLIENT_DISCONNECTED_IND_ID           = 0xcf,   ///< \b AP_CLIENT_DISCONNECTED indication id. Content is SL_WFX_AP_CLIENT_DISCONNECTED_IND_BODY
} sl_wfx_indications_ids_t;

/**
 * @brief WFM API message IDs.
 */
typedef union __attribute__((__packed__)) wfm_message_ids_u {
  /** Request messages sent from the host to the device. */
  sl_wfx_requests_ids_t requests;
  /** Confirmation messages sent from the device to the host. */
  sl_wfx_confirmations_ids_t confirmations;
  /** Indication messages sent from the device to the host. */
  sl_wfx_indications_ids_t indications;
} sl_wfx_message_ids_t;

/**
 * @}
 */

/**
 * @addtogroup WFM_GROUP_CONSTANTS
 * @{
 */

/** Length of the MAC address element. */
#define SL_WFX_FMAC_MAC_ADDR_SIZE                SL_WFX_MAC_ADDR_SIZE
/** Length of the BSSID element. */
#define SL_WFX_FMAC_BSSID_SIZE                   SL_WFX_BSSID_SIZE
/** Length of the password element. */
#define SL_WFX_PASSWORD_SIZE                     64
/** Maximum length of the channel list element. */
#define SL_WFX_CHANNEL_NUMBER_SIZE               14
/** Maximum length of the SSID list element. */
#define SL_WFX_SSID_DEF_SIZE                     2
/** Length of the Service Set Identifier (SSID) element. */
#define SL_WFX_FMAC_SSID_SIZE                    SL_WFX_SSID_SIZE
/** Length of the ARP IP address list element. */
#define SL_WFX_ARP_IP_ADDR_SIZE                  2
/** Length of the NS IP address list element. */
#define SL_WFX_NS_IP_ADDR_SIZE                   2
/** Length of the IPv6 address element. */
#define SL_WFX_IPV6_ADDR_SIZE                    16

/**
 * @brief Client Isolation toggling.
 */
typedef enum sl_wfx_client_isolation_e {
  WFM_CLIENT_ISOLATION_DISABLED                  = 0x0,    ///< Client isolation disabled
  WFM_CLIENT_ISOLATION_ENABLED                   = 0x1     ///< Client isolation enabled
} sl_wfx_client_isolation_t;

/**
 * @brief Type of frame to be sent.
 *
 * Value unused, all frames are considered to be Data by default.@n
 * Support for the other types will be added later.
 */
typedef enum sl_wfx_frame_type_e {
  WFM_FRAME_TYPE_MGMT                            = 0x0,    ///< Management Frame
  WFM_FRAME_TYPE_ACTION                          = 0x4,    ///< Action Frame
  WFM_FRAME_TYPE_DATA                            = 0x8     ///< Data Frame
} sl_wfx_frame_type_t;

/**
 * @brief Hidden SSID toggling.
 */
typedef enum sl_wfx_hidden_ssid_e {
  WFM_HIDDEN_SSID_FALSE                          = 0x0,    ///< SSID not hidden
  WFM_HIDDEN_SSID_TRUE                           = 0x1     ///< SSID hidden
} sl_wfx_hidden_ssid_t;

/**
 * @brief Device Protected Management Frame mode.
 */
typedef enum sl_wfx_mgmt_frame_protection_e {
  WFM_MGMT_FRAME_PROTECTION_DISABLED             = 0x0,    ///< PMF disabled
  WFM_MGMT_FRAME_PROTECTION_OPTIONAL             = 0x1,    ///< PMF optional
  WFM_MGMT_FRAME_PROTECTION_MANDATORY            = 0x2     ///< PMF mandatory
} sl_wfx_mgmt_frame_protection_t;

/**
 * @brief Device power management mode.
 */
typedef enum sl_wfx_pm_mode_e {
  WFM_PM_MODE_ACTIVE                             = 0x0,    ///< Always on
  WFM_PM_MODE_PS                                 = 0x1,    ///< Use power_save and wake up on beacons
  WFM_PM_MODE_DTIM                               = 0x2     ///< Use power_save and wake up on DTIM
} sl_wfx_pm_mode_t;

/**
 * @brief Data priority level per 802.1D.
 */
typedef enum sl_wfx_priority_e {
  WFM_PRIORITY_BE0                               = 0x0,    ///< Best Effort
  WFM_PRIORITY_BK1                               = 0x1,    ///< Background
  WFM_PRIORITY_BK2                               = 0x2,    ///< Background
  WFM_PRIORITY_BE3                               = 0x3,    ///< Best Effort
  WFM_PRIORITY_VI4                               = 0x4,    ///< Video
  WFM_PRIORITY_VI5                               = 0x5,    ///< Video
  WFM_PRIORITY_VO6                               = 0x6,    ///< Voice
  WFM_PRIORITY_VO7                               = 0x7     ///< Voice
} sl_wfx_priority_t;

/**
 * @brief Reasons for AP to reject or disconnect a client.
 */
typedef enum sl_wfx_reason_e {
  WFM_REASON_UNSPECIFIED                         = 0x0,    ///< Unspecified reason (unused)
  WFM_REASON_TIMEOUT                             = 0x1,    ///< Client timed out
  WFM_REASON_LEAVING_BSS                         = 0x2,    ///< Client left
  WFM_REASON_UNKNOWN_STA                         = 0x3,    ///< Client not authenticated
  WFM_REASON_AP_FULL                             = 0x4,    ///< Too many clients already connected
  WFM_REASON_AUTHENTICATION_FAILURE              = 0x5     ///< WPA authentication failed
} sl_wfx_reason_t;

/**
 * @brief Reasons for STA disconnection
 */
typedef enum sl_wfx_disconnected_reason_e {
  WFM_DISCONNECTED_REASON_UNSPECIFIED            = 0x0,    ///< Unspecified reason
  WFM_DISCONNECTED_REASON_AP_LOST                = 0x1,    ///< AP timed out
  WFM_DISCONNECTED_REASON_REJECTED               = 0x2,    ///< Disconnected by AP
  WFM_DISCONNECTED_REASON_LEAVING_BSS            = 0x3,    ///< Leaving intentionally
  WFM_DISCONNECTED_REASON_WPA_COUNTERMEASURES    = 0x4     ///< WPA countermeasures triggered a disconnection
} sl_wfx_disconnected_reason_t;

/**
 * @brief Scan mode to be used.
 */
typedef enum sl_wfx_scan_mode_e {
  WFM_SCAN_MODE_PASSIVE                          = 0x0,    ///< Passive scan: listen for beacons only
  WFM_SCAN_MODE_ACTIVE                           = 0x1     ///< Active scan: send probe requests
} sl_wfx_scan_mode_t;

/**
 * @brief Security mode of a network.
 */
typedef enum sl_wfx_security_mode_e {
  WFM_SECURITY_MODE_OPEN                         = 0x0,    ///< No security
  WFM_SECURITY_MODE_WEP                          = 0x1,    ///< Use WEP
  WFM_SECURITY_MODE_WPA2_WPA1_PSK                = 0x2,    ///< Use WPA1 or WPA2
  WFM_SECURITY_MODE_WPA2_PSK                     = 0x4     ///< Use only WPA2
} sl_wfx_security_mode_t;

/**
 * @brief Full MAC (UMAC) confirmation possible values for a returned 'status' field.
 *
 * All Full MAC (UMAC) confirmation messages have a field 'status' just after the message header.@n
 * A value of zero indicates the request has completed successfully.
 */
typedef enum sl_wfx_fmac_status_e {
  WFM_STATUS_SUCCESS                             = 0x0,    ///< The device has successfully completed a request.
  WFM_STATUS_INVALID_PARAMETER                   = 0x1,    ///< A request contains one or more invalid parameters.
  WFM_STATUS_WRONG_STATE                         = 0x2,    ///< The request cannot be performed because the device is in an inappropriate state.
  WFM_STATUS_GENERAL_FAILURE                     = 0x3,    ///< The request failed due to an error.
  WFM_STATUS_CHANNEL_NOT_ALLOWED                 = 0x4,    ///< The request failed due to regulatory limitations.
  WFM_STATUS_WARNING                             = 0x5,    ///< The request is successful but some parameters have been ignored.
  WFM_STATUS_NO_MATCHING_AP                      = 0x6,    ///< The request failed because no suitable AP was found for the connection
  WFM_STATUS_CONNECTION_ABORTED                  = 0x7,    ///< The request failed because the user issued a WFM_HI_DISCONNECT_REQ before completing the connection
  WFM_STATUS_CONNECTION_TIMEOUT                  = 0x8,    ///< The request failed because a timeout occurred during connection
  WFM_STATUS_CONNECTION_REJECTED_BY_AP           = 0x9,    ///< The request failed because the AP rejected the connection
  WFM_STATUS_CONNECTION_AUTH_FAILURE             = 0xA,    ///< The request failed because the WPA handshake did not complete successfully
  WFM_STATUS_RETRY_EXCEEDED                      = 0x13,   ///< The request failed because the retry limit was exceeded.
  WFM_STATUS_TX_LIFETIME_EXCEEDED                = 0x14    ///< The request failed because the MSDU life time was exceeded.
} sl_wfx_fmac_status_t;

/**
 * @}
 */

/**
 * @addtogroup WFM_GROUP_TYPES
 * @{
 */

/**
 * @brief Service Set Identifier (SSID) of a network.
 * @details Note that the Ssid element must always contain SL_WFX_SSID_SIZE bytes.
 *          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ssid_def_s {
  /**
   * @brief Length of SSID data.
   * @details <B>0 - 32</B>: The amount of bytes.
   */
  uint32_t ssid_length;
  /** SSID data. */
  uint8_t  ssid[SL_WFX_SSID_SIZE];
} sl_wfx_ssid_def_t;

/**
 * @brief Security mode bitmask for scan results. Empty if Open network.
 */
typedef struct __attribute__((__packed__)) sl_wfx_security_mode_bitmask_s {
  uint8_t  wep : 1;                                        ///< Network supports WEP
  uint8_t  wpa : 1;                                        ///< Network supports WPA. If both WPA bits are set the network supports mixed mode.
  uint8_t  wpa2 : 1;                                       ///< Network supports WPA2. If both WPA bits are set the network supports mixed mode.
  uint8_t  wpa3 : 1;                                       ///< Network supports WPA3. If multiple WPA bits are set the network supports mixed mode.
  uint8_t  pmf : 1;                                        ///< Networks requires use of Protected Management Frames
  uint8_t  unused : 1;                                     ///< Reserved, set to zero
  uint8_t  psk : 1;                                        ///< Network supports Personal authentication
  uint8_t  eap : 1;                                        ///< Network supports Enterprise authentication
} sl_wfx_security_mode_bitmask_t;

