eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Indication message body for sl_wfx_connect_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_connect_ind_body_s {
  /**
   * @brief Status of the connection request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the connection request was completed successfully.
   *          <BR><B>any other value</B>: the connection request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief MAC address of the connected access point.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief Channel of the connected access point.
   * @details <B>1 - 13</B>: Channel number.
   */
  uint16_t channel;
  /**
   * @brief Beacon Interval of the connected access point.
   */
  uint8_t  beacon_interval;
  /**
   * @brief DTIM period of the connected access point.
   * @details <B>1 - 255</B>: DTIM period.
   */
  uint8_t  dtim_period;
  /**
   * @brief Maximum PHY data rate supported by the connection.
   * @details See sl_wfx_rate_index_t for enumeration values.
   */
  uint16_t max_phy_rate;
} sl_wfx_connect_ind_body_t;

/**
 * @brief Indication message used to signal the completion of a connection operation.
 * @details The device will send this indication to signal the connection request initiated
 *          with sl_wfx_connect_req_t has been completed. The indication is also sent when
 *          the device autonomously roams to another access point.
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_connect_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_connect_ind_body_t body;
} sl_wfx_connect_ind_t;

/**
 * @struct sl_wfx_disconnect_req_t
 * @brief Request message for disconnecting from a Wi-Fi network.
 * @details The host can use this request to initiate a disconnection from a Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef sl_wfx_header_t sl_wfx_disconnect_req_t;

/**
 * @brief Confirmation message body for sl_wfx_disconnect_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_cnf_body_s {
  /**
   * @brief Status of the disconnection request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the disconnection request was accepted. It will be completed by sl_wfx_disconnect_ind_t.
   *          <BR><B>any other value</B>: the disconnection request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_disconnect_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_disconnect_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_disconnect_cnf_body_t body;
} sl_wfx_disconnect_cnf_t;

/**
 * @brief Indication message body for sl_wfx_disconnect_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ind_body_s {
  /**
   * @brief MAC address of the access point.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief Reason for disconnection.
   * @details <B>WFM_DISCONNECTED_REASON_UNSPECIFIED</B>: The device disconnected because of an internal error.
   *          <BR><B>WFM_DISCONNECTED_REASON_AP_LOST</B>: The device lost the AP beacons for too long.
   *          <BR><B>WFM_DISCONNECTED_REASON_REJECTED</B>: The device was disconnected by the AP.
   *          <BR><B>WFM_DISCONNECTED_REASON_LEAVING_BSS</B>: Disconnection was requested through the device API.
   *          <BR><B>WFM_DISCONNECTED_REASON_WPA_COUNTERMEASURES</B>: WPA countermeasures triggered a disconnection
   *          <BR>See sl_wfx_disconnected_reason_t for enumeration values.
   */
  uint16_t reason;
} sl_wfx_disconnect_ind_body_t;

/**
 * @brief Indication message used to signal the completion of a disconnection operation.
 * @details The device will send this indication to signal the disconnection request initiated
 *          with sl_wfx_disconnect_req_t has been completed. The indication is also sent when
 *          the device has lost the connection to an access point and has been unable to regain it.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_disconnect_ind_body_t body;
} sl_wfx_disconnect_ind_t;

/**
 * @struct sl_wfx_get_signal_strength_req_t
 * @brief Request message for retrieving the signal strength of connection.
 * @details The host can use this request to retrieve the signal strength of the connection.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef sl_wfx_header_t sl_wfx_get_signal_strength_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_signal_strength_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_signal_strength_cnf_body_s {
  /**
   * @brief Status of the get request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed.
   *          <BR><B>any other value</B>: the get request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Received Channel Power Indicator (RCPI) of the connection.
   * @details See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint32_t rcpi;
} sl_wfx_get_signal_strength_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_signal_strength_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_signal_strength_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_signal_strength_cnf_body_t body;
} sl_wfx_get_signal_strength_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_pm_mode_req_t.
 * @details
 *          | Field          | Default value      | Reset to default value |
 *          |:---------------|:-------------------|:-----------------------|
 *          | power_mode      | WFM_PM_MODE_ACTIVE | when interface stopped |
 *          | listen_interval | 0                  | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_pm_mode_req_body_s {
  /**
   * @brief Power management mode.
   * @details <B>WFM_PM_MODE_ACTIVE</B>: the device will not use Wi-Fi power management mechanisms.
   *          <BR><B>WFM_PM_MODE_BEACON</B>: the device will wake-up on beacons.
   *          <BR><B>WFM_PM_MODE_DTIM</B>: the device will wake-up on DTIMs.
   *          <BR>See wfm_pm_mode for enumeration values.
   */
  uint16_t power_mode;
  /**
   * @brief Number of beacons/DTIMs to skip while sleeping.
   * @details <B>0</B>: wake-up on every beacon/DTIM.
   *          <BR><B>1 - 600</B>: the number of beacon/DTIMs to skip.
   *          <BR>See @ref WFM_CONCEPT_PM for further details.
   */
  uint16_t listen_interval;
} sl_wfx_set_pm_mode_req_body_t;

/**
 * @brief Request message for setting the power management mode of the device.
 * @details The host can use this request to enable or disable Wi-Fi power management mechanisms.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_pm_mode_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_pm_mode_req_body_t body;
} sl_wfx_set_pm_mode_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_pm_mode_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_pm_mode_cnf_body_s {
  /**
   * @brief Status of the power management request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the power management request was completed.
   *          <BR><B>any other value</B>: the power management request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_pm_mode_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_pm_mode_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_pm_mode_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_pm_mode_cnf_body_t body;
} sl_wfx_set_pm_mode_cnf_t;

/**
 * @brief Request message body for sl_wfx_start_ap_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_req_body_s {
  /**
   * @brief Service Set Identifier (SSID) of the network.
   */
  sl_wfx_ssid_def_t ssid_def;
  /**
   * @brief Boolean option to hide the network.
   * @details <B>0</B>: The device will advertise the SSID of the network to any near-by stations.
   *          <BR><B>1</B>: The device will hide the SSID of the network and will only respond
   *                        to stations that specify the SSID.
   *          <BR>See @ref WFM_CONCEPT_HIDDEN for further details.
   */
  uint8_t  hidden_ssid;
  /**
   * @brief Boolean option to isolate connected clients from each other.
   * @details <B>0</B>: The device will allow connected clients to communicate with each other.
   *          <BR><B>1</B>: The device will prevent multiple connected clients from communicating.
   *          <BR>Regardless of the value, the connected stations will always be able to communicate with the device.
   *          <BR>See @ref WFM_CONCEPT_ISOLATION for further details.
   */
  uint8_t  client_isolation;
  /**
   * @brief Security mode of the Access Point.
   * @details <B>WFM_SECURITY_MODE_OPEN</B>: The device will only allow unsecured connections.
   *          <BR><B>WFM_SECURITY_MODE_WEP</B>: The device will only allow WEP connections.
   *          <BR><B>WFM_SECURITY_MODE_WPA2_WPA1_PSK</B>: The device will only allow WPA-Personal and WPA2-Personal connections.
   *          <BR><B>WFM_SECURITY_MODE_WPA2_PSK</B>: The device will only allow WPA2-Personal connections.
   *          <BR>See wfm_security_mode for enumeration values.
   */
  uint8_t  security_mode;
  /**
   * @brief Protected Management Frames (PMF) mode.
   * @details <B>WFM_MGMT_FRAME_PROTECTION_DISABLED</B>: The device will not use PMF even if supported by the connecting station.
   *          <BR><B>WFM_MGMT_FRAME_PROTECTION_OPTIONAL</B>: The device will use PMF if supported by the connecting station.
   *          <BR><B>WFM_MGMT_FRAME_PROTECTION_MANDATORY</B>: The device will only allow connecting stations that support PMF.
   *          <BR>See wfm_mgmt_frame_protection for enumeration values.
   */
  uint8_t  mgmt_frame_protection;
  /**
   * @brief Channel of the Access Point.
   * @details <B>1 - 13</B>: The device will create the access point on the given channel.
   */
  uint16_t channel;
  /**
   * @brief Length of the network password.
   * @details <B>0 - 64</B>: The amount of bytes.
   */
  uint16_t password_length;
  /**
   * @brief Password of the network.
   * @details <B>64-bit WEP key</B>: 5 bytes in ASCII format or 10 bytes in HEX format.
   *          <BR><B>128-bit WEP key</B>: 13 bytes in ASCII format or 26 bytes in HEX format.
   *          <BR><B>WPA pass phrase</B>: 8 - 63 bytes in ASCII format.
   *          <BR><B>WPA PMK</B>: 64 bytes in HEX format.
   *          <BR>See @ref WFM_CONCEPT_PASSWORD for further details.
   */
  uint8_t  password[SL_WFX_PASSWORD_SIZE];
  /**
   * @brief Length of vendor-specific Information Element (IE) data in 802.11 Beacon frames.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t beacon_ie_data_length;
  /**
   * @brief Length of vendor-specific Information Element (IE) data in 802.11 Probe Response frames.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t probe_resp_ie_data_length;
  /**
   * @brief Vendor-specific IE data added to the 802.11 Beacon frames and Probe Response frames.
   * @details The IE data must be in 802.11 Vendor-Specific Element format. It may contain
   *          multiple concatenated IEs, up to the maximum length. First part of the IE data,
   *          up to the amount of bytes specified in BeaconIeDataLength, is added to the Beacon
   *          frames. The remaining part whose length is defined in ProbeRespIeDataLength is added
   *          to the Probe Response frames.
   *          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details.
   */
  uint8_t  ie_data[];
} sl_wfx_start_ap_req_body_t;

/**
 * @brief Request message for starting a Wi-Fi network.
 * @details The host can use this request to initiate a Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | No              |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_start_ap_req_body_t body;
} sl_wfx_start_ap_req_t;

/**
 * @brief Confirmation message body for sl_wfx_start_ap_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_cnf_body_s {
  /**
   * @brief Status of the start request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the start request was accepted. It will be completed by sl_wfx_start_ap_ind_t.
   *          <BR><B>any other value</B>: the start request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_start_ap_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_start_ap_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_start_ap_cnf_body_t body;
} sl_wfx_start_ap_cnf_t;

/**
 * @brief Indication message body for sl_wfx_start_ap_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_ind_body_s {
  /**
   * @brief Status of the start request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the start request was completed successfully.
   *          <BR><B>any other value</B>: the start request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_start_ap_ind_body_t;

/**
 * @brief Indication message used to signal the completion of a start request.
 * @details The device will send this indication to signal the start request initiated
 *          with sl_wfx_start_ap_req_t has been completed.
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_ap_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_start_ap_ind_body_t body;
} sl_wfx_start_ap_ind_t;

/**
 * @brief Request message body for sl_wfx_update_ap_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_update_ap_req_body_s {
  /**
   * @brief Length of vendor-specific Information Element (IE) data in 802.11 Beacon frames.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t beacon_ie_data_length;
  /**
   * @brief Length of vendor-specific Information Element (IE) data in 802.11 Probe Response frames.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t probe_resp_ie_data_length;
  /**
   * @brief Vendor-specific IE data added to the 802.11 Beacon frames and Probe Response frames.
   * @details The IE data must be in 802.11 Vendor-Specific Element format. It may contain
   *          multiple concatenated IEs, up to the maximum length. First part of the IE data,
   *          up to the amount of bytes specified in BeaconIeDataLength, is added to the Beacon
   *          frames. The remaining part whose length is defined in ProbeRespIeDataLength is added
   *          to the Probe Response frames.
   *          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details.
   */
  uint8_t  ie_data[];
} sl_wfx_update_ap_req_body_t;

/**
 * @brief Request message for updating parameters of the started Wi-Fi network.
 * @details The host can use this request to update parameters of the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_update_ap_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_update_ap_req_body_t body;
} sl_wfx_update_ap_req_t;

/**
 * @brief Confirmation message body for sl_wfx_update_ap_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_update_ap_cnf_body_s {
  /**
   * @brief Status of the update request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the update request was completed.
   *          <BR><B>any other value</B>: the update request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_update_ap_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_update_ap_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_update_ap_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_update_ap_cnf_body_t body;
} sl_wfx_update_ap_cnf_t;

/**
 * @struct sl_wfx_stop_ap_req_t
 * @brief Request message for stopping the started Wi-Fi network.
 * @details The host can use this request to stop the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_stop_ap_req_t;

/**
 * @brief Confirmation message body for sl_wfx_stop_ap_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_stop_ap_cnf_body_s {
  /**
   * @brief Status of the stop request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the stop request was accepted. It will be completed by sl_wfx_stop_ap_ind_t.
   *          <BR><B>any other value</B>: the stop request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_stop_ap_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_stop_ap_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_stop_ap_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_stop_ap_cnf_body_t body;
} sl_wfx_stop_ap_cnf_t;

/**
 * @struct sl_wfx_stop_ap_ind_t
 * @brief Indication message used to signal the completion of a stop operation.
 * @details The device will send this indication to signal the stop request initiated
 *          with sl_wfx_stop_ap_req_t has been completed. The indication is also sent when
 *          the started network has encountered a fatal error.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_stop_ap_ind_t;

/**
 * @brief Indication message body for sl_wfx_ap_client_connected_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_connected_ind_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_ap_client_connected_ind_body_t;

/**
 * @brief Indication message used to signal a connected station.
 * @details The device will send this indication to signal a station has connected
 *          to the started network.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_connected_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_ap_client_connected_ind_body_t body;
} sl_wfx_ap_client_connected_ind_t;

/**
 * @brief Indication message body for sl_wfx_ap_client_rejected_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_rejected_ind_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief Reason for rejection.
   * @details <B>WFM_REASON_TIMEOUT</B>: A timeout occurred during a station connection attempt.
   *          <BR><B>WFM_REASON_LEAVING_BSS</B>: The device sent a deauth before completing the connection.
   *          <BR><B>WFM_REASON_UNKNOWN_STA</B>: The device received data from a non-connected station.
   *          <BR><B>WFM_REASON_AP_FULL</B>: The device was not able to accommodate any more stations.
   *          <BR><B>WFM_REASON_AUTHENTICATION_FAILURE</B>: The device did not complete the WPA authentication successfully.
   *          <BR>See wfm_reason for enumeration values.
   */
  uint16_t reason;
} sl_wfx_ap_client_rejected_ind_body_t;

/**
 * @brief Indication message used to signal a rejected connection attempt from a station.
 * @details The device will send this indication to signal a station has attempted
 *          connection to the started network and was rejected by the device.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_rejected_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_ap_client_rejected_ind_body_t body;
} sl_wfx_ap_client_rejected_ind_t;

/**
 * @brief Request message body for sl_wfx_disconnect_ap_client_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ap_client_req_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_disconnect_ap_client_req_body_t;

/**
 * @brief Request message for disconnecting a client from the started Wi-Fi network.
 * @details The host can use this request to disconnect a client from the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ap_client_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_disconnect_ap_client_req_body_t body;
} sl_wfx_disconnect_ap_client_req_t;

/**
 * @brief Confirmation message body for sl_wfx_disconnect_ap_client_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ap_client_cnf_body_s {
  /**
   * @brief Status of the disconnect request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the disconnect request was completed.
   *          <BR><B>any other value</B>: the disconnect request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_disconnect_ap_client_cnf_body_t;

