eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Confirmation message for sl_wfx_disconnect_ap_client_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_disconnect_ap_client_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_disconnect_ap_client_cnf_body_t body;
} sl_wfx_disconnect_ap_client_cnf_t;

/**
 * @brief Indication message body for sl_wfx_ap_client_disconnected_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_disconnected_ind_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief Reason for disconnection.
   * @details <B>WFM_REASON_LEAVING_BSS</B>: The station was disconnected or it disconnected on its own.
   *          <BR>See wfm_reason for enumeration values.
   */
  uint16_t reason;
} sl_wfx_ap_client_disconnected_ind_body_t;

/**
 * @brief Indication message used to signal a disconnected station.
 * @details The device will send this indication to signal a station has left
 *          the started network.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_client_disconnected_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_ap_client_disconnected_ind_body_t body;
} sl_wfx_ap_client_disconnected_ind_t;

/**
 * @brief Request message body for sl_wfx_send_frame_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_send_frame_req_body_s {
  /**
   * @brief Packet type.
   * @details <B>0</B>: Data packet with Ethernet II frame header.
   */
  uint8_t  frame_type;
  /**
   * @brief User Priority level.
   * @details <B>0 - 7</B>: 802.1D Priority field value.
   */
  uint8_t  priority;
  /**
   * @brief Packet ID number.
   * @details <B>0 - 65535</B>: Host-assigned unique number for the packet.
   *          <BR>The number is returned in the corresponding confirmation message.
   */
  uint16_t packet_id;
  /**
   * @brief Length of packet data.
   * @details <B>1 - 1604</B>: The amount of bytes.
   */
  uint32_t packet_data_length;
  /**
   * @brief Data of the packet.
   * @details See @ref WFM_CONCEPT_PACKET for further details.
   */
  uint8_t  packet_data[];
} sl_wfx_send_frame_req_body_t;

/**
 * @brief Request message for sending a packet to the network.
 * @details The host can use this request to send a packet to the network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_send_frame_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_send_frame_req_body_t body;
} sl_wfx_send_frame_req_t;

/**
 * @brief Confirmation message body for sl_wfx_send_frame_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_send_frame_cnf_body_s {
  /**
   * @brief Status of the send request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the send request was completed.
   *          <BR><B>any other value</B>: the send request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Packet ID number from the corresponding request.
   */
  uint16_t packet_id;
  /**
   * @brief Reserved.
   */
  uint16_t reserved;
} sl_wfx_send_frame_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_send_frame_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_send_frame_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_send_frame_cnf_body_t body;
} sl_wfx_send_frame_cnf_t;

/**
 * @brief Indication message body for sl_wfx_received_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_received_ind_body_s {
  /**
   * @brief Packet type.
   * @details <B>0</B>: Data packet with Ethernet II frame header.
   */
  uint8_t  frame_type;
  /**
   * @brief The amount of padding bytes before the packet data.
   * @details <B>0 - 3</B>: The amount of bytes.
   */
  uint8_t  frame_padding;
  /**
   * @brief Length of packet data excluding the padding bytes.
   * @details <B>1 - 2310</B>: The amount of bytes.
   */
  uint16_t frame_length;
  /**
   * @brief Packet data, including the padding bytes before the packet data.
   * @details See @ref WFM_CONCEPT_PACKET for further details.
   */
  uint8_t  frame[];
} sl_wfx_received_ind_body_t;

/**
 * @brief Indication message used to signal a received packet.
 * @details The device will send this indication to signal a packet
 *          has been received.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_received_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_received_ind_body_t body;
} sl_wfx_received_ind_t;

/**
 * @brief Request message body for sl_wfx_start_scan_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_scan_req_body_s {
  /**
   * @brief Scan mode.
   * @details <B>WFM_SCAN_MODE_PASSIVE</B>: The device will perform a passive scan.
   *          <BR><B>WFM_SCAN_MODE_ACTIVE</B>: The device will perform an active scan.
   *          <BR>See wfm_scan_mode for enumeration values.
   *          <BR>See @ref WFM_CONCEPT_SCAN for further details.
   */
  uint16_t scan_mode;
  /**
   * @brief The amount of specific channels to scan.
   * @details <B>0</B>: The device will scan all channels
   *          <BR><B>1 - 13</B>: The amount of specific channels to scan.
   */
  uint16_t channel_list_count;
  /**
   * @brief The amount of specific SSIDs to scan.
   * @details <B>0</B>: The device will perform a broadcast scan
   *          <BR><B>1 - 2</B>: The amount of specific SSIDs to scan.
   */
  uint16_t ssid_list_count;
  /**
   * @brief Length of vendor-specific Information Element (IE) data in 802.11 Probe Request frames.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t ie_data_length;
  /**
   * @brief Data for the variable-length scan parameters.
   * @details The variable-length scan parameters are concatenated together without any
   *          padding between the different parameters.
   * @par 1. List of specific channels to scan.
   * @details <B>1 - 13</B>: The channel number to scan per byte.
   *          <BR>Must contain the same number of channels as specified in ChannelListCount.
   *          <BR>See @ref WFM_CONCEPT_SCAN for further details.
   * @par 2. List of specific SSIDs to scan.
   * @details Must contain the same number of WfmHiSsidDef_t elements as specified in SsidListCount.
   *          <BR>This parameter is applicable only for an active scan. See @ref WFM_CONCEPT_SCAN for further details.
   * @par 3. Vendor-specific IE data added to the 802.11 Probe Request frames.
   * @details The IE data must be in 802.11 Vendor-Specific Element format.
   *          It may contain multiple concatenated IEs, up to the maximum length.
   *          <BR>This parameter is applicable only for an active scan. See @ref WFM_CONCEPT_VENDOR_IE for further details.
   * @par 4. Basic Service Set Identifier (BSSID) to scan.
   * @details <B>broadcast address</B>: The device will send Probe Request frames to all devices.
   *          <BR><B>unicast address</B>: The device will send Probe Request frames to a specific device.
   *          <BR>This parameter is applicable only for an active scan. If not specified, broadcast address is assumed.
   *          <BR>Note that an SSID list must be specified when using the unicast address, otherwise the received
   *          scan results may contain unexpected additional networks.
   *          <BR>See @ref WFM_CONCEPT_BSSID for further details.
   */
  uint8_t  data[];
} sl_wfx_start_scan_req_body_t;

/**
 * @brief Request message for starting a scan to detect near-by access points.
 * @details The host can use this request to start a scan operation to detect near-by access points.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_scan_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_start_scan_req_body_t body;
} sl_wfx_start_scan_req_t;

/**
 * @brief Confirmation message body for sl_wfx_start_scan_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_scan_cnf_body_s {
  /**
   * @brief Status of the scan request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the scan request was accepted. It will be completed by sl_wfx_scan_complete_ind_t.
   *          <BR><B>any other value</B>: the scan request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_start_scan_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_start_scan_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_start_scan_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_start_scan_cnf_body_t body;
} sl_wfx_start_scan_cnf_t;

/**
 * @struct sl_wfx_stop_scan_req_t
 * @brief Request message for stopping an ongoing scan.
 * @details The host can use this request to stop an ongoing scan operation.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | No              |
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef sl_wfx_header_t sl_wfx_stop_scan_req_t;

/**
 * @brief Confirmation message body for sl_wfx_stop_scan_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_stop_scan_cnf_body_s {
  /**
   * @brief Status of the stop request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the stop request was accepted. It will be completed by WFM_HI_SCAN_COMPLETE_IND.
   *          <BR><B>any other value</B>: the stop request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_stop_scan_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_stop_scan_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_stop_scan_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_stop_scan_cnf_body_t body;
} sl_wfx_stop_scan_cnf_t;

/**
 * @brief Indication message body for sl_wfx_scan_result_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_scan_result_ind_body_s {
  /**
   * @brief Service Set Identifier (SSID) of the network.
   */
  sl_wfx_ssid_def_t ssid_def;
  /**
   * @brief MAC address of the access point.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief Channel of the access point.
   * @details <B>1 - 13</B>: Channel number.
   */
  uint16_t channel;
  /**
   * @brief Security Capabilities of the network.
   */
  sl_wfx_security_mode_bitmask_t security_mode;
  /**
   * @brief Reserved.
   */
  uint8_t  reserved1;
  /**
   * @brief Reserved.
   */
  uint16_t reserved2;
  /**
   * @brief Received Channel Power Indicator (RCPI) of the access point.
   * @details See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint16_t rcpi;
  /**
   * @brief Length of access point Information Element (IE) data in bytes.
   */
  uint16_t ie_data_length;
  /**
   * @brief Access point IE data from the 802.11 Beacon or Probe Response frame.
   */
  uint8_t  ie_data[];
} sl_wfx_scan_result_ind_body_t;

/**
 * @brief Indication message used to signal an access point has been detected.
 * @details The device will send this indication to signal an access point has
 *          has been detected during the scan operation.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_scan_result_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_scan_result_ind_body_t body;
} sl_wfx_scan_result_ind_t;

/**
 * @brief Indication message body for sl_wfx_scan_complete_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_scan_complete_ind_body_s {
  /**
   * @brief Status of the scan request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the scan request was completed.
   *          <BR><B>any other value</B>: the scan request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_scan_complete_ind_body_t;

/**
 * @brief Indication message used to signal a scan was completed.
 * @details The device will send this indication to signal a scan operation
 *          has been completed.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_scan_complete_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_scan_complete_ind_body_t body;
} sl_wfx_scan_complete_ind_t;

/**
 * @brief Request message body for sl_wfx_add_multicast_addr_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_multicast_addr_req_body_s {
  /**
   * @brief MAC address to add.
   * @details <B>broadcast address</B>: The device will empty the whitelist and allow all multicast addresses.
   *          <BR><B>zero address</B>: The device will empty the whitelist and deny all multicast addresses.
   *          <BR><B>multicast address</B>: The device will add the given address to the whitelist.
   *          <BR>See @ref WFM_CONCEPT_BSSID for further details.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_add_multicast_addr_req_body_t;

/**
 * @brief Request message for adding a multicast address to the multicast filter whitelist.
 * @details The host can use this request to add a multicast address to the multicast filter
 *          whitelist. When the first address is added the whitelist, the device will discard
 *          all multicast frames whose destination address does not match any of the addresses
 *          on the list. The default state is to allow all multicast addresses. The whitelist
 *          is reset to the default state when the interface is reset. Up to 8 multicast addresses
 *          may be added.
 *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_multicast_addr_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_add_multicast_addr_req_body_t body;
} sl_wfx_add_multicast_addr_req_t;

/**
 * @brief Confirmation message body for sl_wfx_add_multicast_addr_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_multicast_addr_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_add_multicast_addr_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_add_multicast_addr_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_multicast_addr_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_add_multicast_addr_cnf_body_t body;
} sl_wfx_add_multicast_addr_cnf_t;

/**
 * @brief Request message body for sl_wfx_remove_multicast_addr_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_remove_multicast_addr_req_body_s {
  /**
   * @brief MAC address to remove.
   * @details <B>multicast address</B>: The device will remove the given address from the whitelist.
   *          <BR>See @ref WFM_CONCEPT_BSSID for further details.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_remove_multicast_addr_req_body_t;

/**
 * @brief Request message for removing a multicast address from the multicast filter whitelist.
 * @details The host can use this request to remove a multicast address from the multicast filter
 *          whitelist.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_remove_multicast_addr_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_remove_multicast_addr_req_body_t body;
} sl_wfx_remove_multicast_addr_req_t;

/**
 * @brief Confirmation message body for sl_wfx_remove_multicast_addr_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_remove_multicast_addr_cnf_body_s {
  /**
   * @brief Status of the remove request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the remove request was completed successfully.
   *          <BR><B>any other value</B>: the remove request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_remove_multicast_addr_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_remove_multicast_addr_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_remove_multicast_addr_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_remove_multicast_addr_cnf_body_t body;
} sl_wfx_remove_multicast_addr_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_max_ap_client_count_req_t.
 * @details
 *          | Field     | Default value | Reset to default value |
 *          |:----------|:--------------|:-----------------------|
 *          | Count     | 8             | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_count_req_body_s {
  /**
   * @brief Maximum number of connected clients.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 8</B>: The maximum number of connected clients.
   */
  uint32_t count;
} sl_wfx_set_max_ap_client_count_req_body_t;

/**
 * @brief Request message for setting the maximum number of connected clients.
 * @details The host can use this request to limit the number of stations that
 *          can connect the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_count_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_max_ap_client_count_req_body_t body;
} sl_wfx_set_max_ap_client_count_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_max_ap_client_count_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_count_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_max_ap_client_count_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_max_ap_client_count_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_count_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_max_ap_client_count_cnf_body_t body;
} sl_wfx_set_max_ap_client_count_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_max_ap_client_inactivity_req_t.
 * @details
 *          | Field             | Default value | Reset to default value |
 *          |:------------------|:--------------|:-----------------------|
 *          | inactivity_timeout | 65            | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_req_body_s {
  /**
   * @brief Maximum amount of client idle time.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 240</B>: The maximum number of seconds.
   */
  uint32_t inactivity_timeout;
} sl_wfx_set_max_ap_client_inactivity_req_body_t;

/**
 * @brief Request message for setting the maximum number of connected clients.
 * @details The host can use this request to limit the number of stations that
 *          can connect the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_max_ap_client_inactivity_req_body_t body;
} sl_wfx_set_max_ap_client_inactivity_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_max_ap_client_count_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_max_ap_client_inactivity_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_max_ap_client_inactivity_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_max_ap_client_inactivity_cnf_body_t body;
} sl_wfx_set_max_ap_client_inactivity_cnf_t;

