eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Confirmation message body for sl_wfx_add_blacklist_addr_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_add_blacklist_addr_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_add_blacklist_addr_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_add_blacklist_addr_cnf_body_t body;
} sl_wfx_add_blacklist_addr_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_max_tx_power_req_t.
 * @details
 *          | Field      | Default value    | Reset to default value |
 *          |:-----------|:-----------------|:-----------------------|
 *          | max_tx_power | device dependent | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_req_body_s {
  /**
   * @brief Maximum transmit power to set
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power;
} sl_wfx_set_max_tx_power_req_body_t;

/**
 * @brief Request message for setting the maximum transmit power of the device.
 * @details The host can use this request to set a maximum transmit power.
 *          The device can still use a lower transmit power depending on regulatory rules
 *          or internal limitations.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_max_tx_power_req_body_t body;
} sl_wfx_set_max_tx_power_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_max_tx_power_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_max_tx_power_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_max_tx_power_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_max_tx_power_cnf_body_t body;
} sl_wfx_set_max_tx_power_cnf_t;

/**
 * @struct sl_wfx_get_max_tx_power_req_t
 * @brief Request message for getting the maximum transmit power
 * @details The host can use this request to get the current value of maximum transmit power.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_get_max_tx_power_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_max_tx_power_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_max_tx_power_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Maximum transmit power for RF port 1.
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power_rf_port1;
  /**
   * @brief Maximum transmit power for RF port 2.
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power_rf_port2;
} sl_wfx_get_max_tx_power_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_max_tx_power_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_max_tx_power_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_max_tx_power_cnf_body_t body;
} sl_wfx_get_max_tx_power_cnf_t;

/**
 * @struct sl_wfx_get_pmk_req_t
 * @brief Request message for getting the Pairwise Master Key (PMK).
 * @details The host can use this request to retrieve the Pairwise Master Key (PMK)
 *          used to connect to the current secure network. PMK can be given
 *          in the next sl_wfx_connect_req_t message to speed up connection
 *          process. See @ref WFM_CONCEPT_PASSWORD for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_get_pmk_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_pmk_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_pmk_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed successfully.
   *          <BR><B>any other value</B>: the get request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Length of the Pairwise Master Key.
   * @details <B>0 - 64</B>: The amount of bytes.
   */
  uint32_t password_length;
  /**
   * @brief PMK of the network.
   * @details <B>WPA PMK</B>: 64 bytes in HEX format.
   *          <BR>See @ref WFM_CONCEPT_PASSWORD for further details.
   */
  uint8_t  password[SL_WFX_PASSWORD_SIZE];
} sl_wfx_get_pmk_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_pmk_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_pmk_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_pmk_cnf_body_t body;
} sl_wfx_get_pmk_cnf_t;

/**
 * @brief Request message body for sl_wfx_get_ap_client_signal_strength_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_req_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_get_ap_client_signal_strength_req_body_t;

/**
 * @brief Request message for retrieving the signal strength of a client of the started Wi-Fi network.
 * @details The host can use this request to retrieve the signal strength of a client of the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_get_ap_client_signal_strength_req_body_t body;
} sl_wfx_get_ap_client_signal_strength_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_ap_client_signal_strength_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_cnf_body_s {
  /**
   * @brief Status of the get request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed.
   *          <BR><B>any other value</B>: the get request failed.
   *          <BR>See WFM_STATUS for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Received Channel Power Indicator (RCPI) of the client.
   * @details See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint32_t rcpi;
} sl_wfx_get_ap_client_signal_strength_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_ap_client_signal_strength_cnf_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_ap_client_signal_strength_cnf_body_t body;
} sl_wfx_get_ap_client_signal_strength_cnf_t;

/**************************************************/

/**
 * @}
 */

/**
 * @}
 */

#endif /* _SL_WFX_CMD_API_H_ */
